Repository: OSGeo-jp/OSGeoLive-doc-omegat
Catalog: tm/overview--openjump_overview.tmx
Source language: en
Languages: ja

source: Desktop GIS
ja: デスクトップ GIS

source: OpenJUMP is an easy to use and powerful desktop GIS that enables users to display, edit, analyse and conflate geographic data. It comes in a CORE and a PLUS edition, with the latter adding lots of useful plugins. OpenJUMP is excellent for data editing and rapid prototyping of GIS functions.
ja: OpenJUMPは、ユーザが地理データを表示、編集、分析、および確認できる、使いやすく強力なデスクトップGISです。CORE版とPLUS版があり、後者には便利なプラグインがたくさん追加されています。OpenJUMPはGIS機能のデータ編集とラピッドプロトタイピングに優れています。

source: Features (Core Features and PlugIns*)
ja: 機能 (主要機能とプラグイン*)

source: Data Formats
ja: データフォーマット

source: reads (files): GML, SHP, DXF+, MIF*, CSV+, KML+, OSM* & TIFF, ASCII grid, JPG, PNG, JPEG2000+, MrSID*, ECW+
ja: 読み取り (ファイル): GML, SHP, DXF+, MIF*, CSV+, KML+, OSM* & TIFF, ASCII grid, JPG, PNG, JPEG2000+, MrSID*, ECW+

source: reads (DB): PostGIS, ArcSDE*, Oracle*, MySQL*, SpatiaLite+, H2 Spatial+, MariaDB+
ja: 読み取り (DB): PostGIS, ArcSDE*, Oracle*, MySQL*, SpatiaLite+, H2 Spatial+, MariaDB+

source: reads (OGC standards): WKT, WMS, KML+, GeoPackage
ja: 読み取り (OGC スタンダード): WKT, WMS, KML+, GeoPackage

source: writes: GML, SHP, WKT, DXF+, CSV+, PostGIS & JPG, TIFF, ASCII grid*, SVG+
ja: 出力: GML, SHP, WKT, DXF+, CSV+, PostGIS & JPG, TIFF, ASCII grid*, SVG+

source: note, formats marked with a (*) require an additional plugin, and with (+) are part of the PLUS edition.
ja: 注:(*)の付いたフォーマットには追加のプラグインが必要で、(+)の付いたフォーマットはPLUSエディションの一部です。

source: Editing & Conflation
ja: 編集と合成

source: drawing points, lines, polygons, multi-geometries, geometry collections and circles (eventually mixed in a single layer)
ja: ポイント、ライン、ポリゴン、マルチジオメトリ、ジオメトリコレクション、円の描画(最終的には一つのレイヤーに混在)

source: adding, moving, deleting vertices
ja: 頂点の追加、移動、削除

source: rotating, scaling, auto-complete polygon
ja: ポリゴンの回転、拡大縮小、オートコンプリート

source: cut, merge, simplify polygons and lines
ja: ポリゴンとラインの切り取り、合成、単純化

source: warping, quality assurance tools
ja: ワーピング、品質保証ツール

source: coordinate conversions between CRS'
ja: CRS間の座標変換

source: Analysis & Query
ja: 解析とクエリー

source: spatial and attribute query functions
ja: 空間クエリー関数と属性クエリー関数

source: analysis : buffer, union, overlay, centroid, convex hull...
ja: 解析:バッファ、和、オーバーレイ、図心、凸包...

source: statistics : length, area, layer statistics, attribute statistics, plots...
ja: 統計:長さ、面積、レイヤーの統計、属性の統計、印刷...

source: editing tools : converter, noder, polygonizer, planar graph, topology cleaning in PLUS edition, ...
ja: 編集ツール : コンバータ、ノード、ポリゴナイザー、平面グラフ、PLUSエディションでのトポロジの消去、...

source: attribute transfer tools : join, matching*
ja: 属性転送ツール : 結合、マッチング*

source: SEXTANTE raster analysis toolbox included in PLUS edition
ja: PLUSエディションに含まれるSEXTANTEラスター解析ツールボックス

source: Customization
ja: カスタマイズ

source: internationalization (cz, de, en, es, fi, fr, hu, it, ja, pt, ta, zh)
ja: 国際化(cz, de, en, es, fi, fr, hu, it, ja, pt, ta, zh)

source: provides an API, scripting via BeanShell and Java Python/Ython
ja: BeanShellおよびJava Python/Ythonを介したAPI、スクリプトの提供

source: Implemented Standards
ja: 実装されている標準規格

source: OGC standards supported: GML2, SFS, WMS, KML, SLD, GeoPackage (reading);
ja: サポートされている OGC スタンダード: GML2, SFS, WMS, KML, SLD, GeoPackage (読み込み);

source: Details
ja: 詳細

source: **Website:** http://www.openjump.org
ja: **ウェブサイト:** http://www.openjump.org

source: **Licence:** GPL
ja: **ライセンス:** GPL

source: **Software Version:** |version-openjump|
ja: **ソフトウェアバージョン:** |version-openjump|

source: **Supported Platforms:** Windows, Linux, Mac, Unix
ja: **対応プラットフォーム:** Windows, Linux, Mac, Unix

source: **Community Support:** http://www.openjump.org/support.html
ja: **コミュニティサポート:** http://www.openjump.org/support.html

source: **Commercial Support:** https://ojwiki.soldin.de/index.php?title=Professional_Support_Page
ja: **商用サポート:** https://ojwiki.soldin.de/index.php?title=Professional_Support_Page

source: **Download Page:** https://sourceforge.net/projects/jump-pilot/files/
ja: **ダウンロードページ:** https://sourceforge.net/projects/jump-pilot/files/

source: Quickstart
ja: クイックスタート

source: :doc:`Quickstart documentation <../quickstart/openjump_quickstart>`
ja: :doc:`クイックスタート文書 <./quickstart/openjump_quickstart>`
